-- MySQL Administrator dump 1.4
--
-- ------------------------------------------------------
-- Server version	5.0.45-community-nt


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


--
-- Definition of table `dbc_itemsubclass`
--

DROP TABLE IF EXISTS `dbc_itemsubclass`;
CREATE TABLE `dbc_itemsubclass` (
  `ref_itemclass` bigint(20) NOT NULL,
  `id` bigint(20) NOT NULL,
  `name` text NOT NULL,
  PRIMARY KEY  (`ref_itemclass`,`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `dbc_itemsubclass`
--

/*!40000 ALTER TABLE `dbc_itemsubclass` DISABLE KEYS */;
INSERT INTO `dbc_itemsubclass` (`ref_itemclass`,`id`,`name`) VALUES 
 (0,0,'Расходуемые'),
 (0,5,'Еда и напитки'),
 (0,1,'Зелье'),
 (0,2,'Эликсир'),
 (0,3,'Фляга'),
 (0,7,'Бинты'),
 (0,6,'Улучшения'),
 (0,4,'Свиток'),
 (0,8,'Другое'),
 (1,0,'Сумка'),
 (1,1,'Сумка душ'),
 (1,2,'Сумка травника'),
 (1,3,'Сумка зачаровывателя'),
 (1,4,'Сумка инженера'),
 (1,5,'Сумка ювелира'),
 (1,6,'Шахтерская сумка'),
 (1,7,'Сумка кожевника'),
 (2,0,'Топор'),
 (2,1,'Топор'),
 (2,2,'Лук'),
 (2,3,'Огнестрельное'),
 (2,4,'Ударное'),
 (2,5,'Ударное'),
 (2,6,'Древковое'),
 (2,7,'Меч'),
 (2,8,'Меч'),
 (2,9,'Устаревшие'),
 (2,10,'Посох'),
 (2,11,'Экзотическое'),
 (2,12,'Экзотическое'),
 (2,13,'Кистевое'),
 (2,14,'Разное'),
 (2,15,'Кинжал'),
 (2,16,'Метательное'),
 (2,17,'Копье'),
 (2,18,'Арбалет'),
 (2,19,'Жезл'),
 (2,20,'Удочка'),
 (3,0,'Красные'),
 (3,1,'Синие'),
 (3,2,'Желтые'),
 (3,3,'Фиолетовые'),
 (3,4,'Зеленые'),
 (3,5,'Оранжевые'),
 (3,6,'Особые'),
 (3,7,'Простые'),
 (3,8,'Радужные'),
 (4,0,'Разное'),
 (4,1,'Ткань'),
 (4,2,'Кожа'),
 (4,3,'Кольчуга'),
 (4,4,'Латы'),
 (4,5,'Кулачный щит(НЕ ИСП.)_'),
 (4,6,'Щит'),
 (4,7,'Манускрипт'),
 (4,8,'Идол'),
 (4,9,'Тотем'),
 (5,0,'Реагент'),
 (6,0,'Жезл(НЕ ИСП.)'),
 (6,1,'Болт(НЕ ИСП.)'),
 (6,2,'Стрелы'),
 (6,3,'Пули'),
 (6,4,'Метательное(НЕ ИСП.)'),
 (7,0,'Хозяйственные товары'),
 (7,10,'Стихии'),
 (7,5,'Ткань'),
 (7,6,'Кожа'),
 (7,7,'Металл и камень'),
 (7,8,'Мясо'),
 (7,9,'Трава'),
 (7,12,'Зачаровывание'),
 (7,4,'Ювелирное дело'),
 (7,1,'Детали'),
 (7,3,'Устройства'),
 (7,2,'Взрывчатка'),
 (7,13,'Материалы'),
 (7,11,'Другое'),
 (8,0,'Стандартный(НЕ ИСП.)'),
 (9,0,'Книга'),
 (9,1,'Кожевничество'),
 (9,2,'Портняжное дело'),
 (9,3,'Инженерное дело'),
 (9,4,'Кузнечное дело'),
 (9,5,'Кулинария'),
 (9,6,'Алхимия'),
 (9,7,'Первая помощь'),
 (9,8,'Зачаровывание'),
 (9,9,'Рыбная ловля'),
 (9,10,'Ювелирное дело'),
 (10,0,'Деньги (НЕ ИСП.)'),
 (11,0,'Колчан(НЕ ИСП.)'),
 (11,1,'Колчан(НЕ ИСП.)'),
 (11,2,'Колчан'),
 (11,3,'Подсумок'),
 (12,0,'Задания'),
 (13,0,'Ключ'),
 (13,1,'Отмычка'),
 (14,0,'Постоянные'),
 (15,0,'Хлам'),
 (15,1,'Реагенты'),
 (15,2,'Питомцы'),
 (15,3,'Праздничные предметы'),
 (15,4,'Другое'),
 (15,5,'Верховые животные');
/*!40000 ALTER TABLE `dbc_itemsubclass` ENABLE KEYS */;




/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
